#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-irPMpnSmvhmEDQ8J

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_eks_node_group.techNode: Refreshing state... [id=tech:techNode]
aws_eks_cluster.tech: Drift detected (delete)
aws_eks_node_group.techNode: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.tech has been deleted
  - resource "aws_eks_cluster" "tech" {
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQnpHY1o4Y0dyMkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UVXlNVE13TXpaYUZ3MHpOREE1TVRNeU1UTTFNelphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURTempUbDRPdTdyRi9nVm5rbUtjMW5wUmNrcHRDOFcrNFBmajUvQ2Q1UzF6K2JqMC9tQXNZZitDWjYKeE44N3c2djd1YnRXQjNxUGFka1FRU2xPMmRIMThlYm11Z2ZDRzNmUTdYWEhWN1BwR2toSUpvb2U4TUlmQXlXTQpzcXdBT245WDVrTms2b3U3VjRhckpTMFExd1BmOVIvdnovaTh1MXgwZEtVdklWWDN2Q2lXelExaytVWUMzWTNNCnhpYjVWcVo2c1FPNnp1c0luM3dIWnZUYUU2OHhWMjl5SC94MWU0eXRLWGVxZ3BkUGpxa3ZwY1l4Wi8wc0xXZXIKTVFXUjJkMzIzaDZvbXQzclhOTFdwZUxFWndrN0pRZnNXT2MzRW9lOFFVQnI3ajBwRkZpQ0p6aTZmdUZOcFY4cAp3V1Bxb2tObG8wT3hhZnZ3WVY0eWREbjFvT0NoQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRMmsvWngxRGJnUlh5SDdPSWczR2dzaXBEMHpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQlBvSTh1QUVzVwpBU29TeFQ4QXRjNU5ZbXZLOU9CUytQMjdDcTZHb3VNU3U0cUkwbjlJSE5nUVJKdkllZTZuOU1UTHhSK3Jma0dKClJIeFRiK240eTlDS25pL1ozWDhQdkFLRlp2Mk1kVGQ5RnZibi9aTWVkWTkyMlRTSEQzNzFBTkZ1ZXowUCtQUVcKckFjQUZyMHByOXN1L2hncHVpdEhnZitNYmRTYjlRazB1bGkyUmp2Zkg0VUs0VitFN3F2U1V1cW1uTGRURFkyUQprNy8yckEzM2JmRkdoSmNDMWRiOHh5QmVXeWVORzR6d3lZWjBjdjM3UlFsU0pjdlFHd3Z4NDFJbmxJeHIyellFClFVV2dGMEt3Z2RPRnpqMXlpL0NiaThrbDAwNXVwVGtwMUMvQldOT1R2cnlCekorR3J1VkpEVDAycjQyVGVvM0YKaXVJVnROOS83ZTc3Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint              = "https://D68241BB7A33B1075F0DCFED28E4877D.gr7.us-east-1.eks.amazonaws.com" -> null
        id                    = "tech"
      - name                  = "tech" -> null
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0291d82d4138268a6",
              + "subnet-04587582b33e4ce96",
              + "subnet-09be1855303d6deed",
              + "subnet-09e2059bbc3ec7028",
              + "subnet-0b3fa0d2fc429e633",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0291d82d4138268a6",
          + "subnet-04587582b33e4ce96",
          + "subnet-09be1855303d6deed",
          + "subnet-09e2059bbc3ec7028",
          + "subnet-0b3fa0d2fc429e633",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://D68241BB7A33B1075F0DCFED28E4877D.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJQnpHY1o4Y0dyMkF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UVXlNVE13TXpaYUZ3MHpOREE1TVRNeU1UTTFNelphTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURTempUbDRPdTdyRi9nVm5rbUtjMW5wUmNrcHRDOFcrNFBmajUvQ2Q1UzF6K2JqMC9tQXNZZitDWjYKeE44N3c2djd1YnRXQjNxUGFka1FRU2xPMmRIMThlYm11Z2ZDRzNmUTdYWEhWN1BwR2toSUpvb2U4TUlmQXlXTQpzcXdBT245WDVrTms2b3U3VjRhckpTMFExd1BmOVIvdnovaTh1MXgwZEtVdklWWDN2Q2lXelExaytVWUMzWTNNCnhpYjVWcVo2c1FPNnp1c0luM3dIWnZUYUU2OHhWMjl5SC94MWU0eXRLWGVxZ3BkUGpxa3ZwY1l4Wi8wc0xXZXIKTVFXUjJkMzIzaDZvbXQzclhOTFdwZUxFWndrN0pRZnNXT2MzRW9lOFFVQnI3ajBwRkZpQ0p6aTZmdUZOcFY4cAp3V1Bxb2tObG8wT3hhZnZ3WVY0eWREbjFvT0NoQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRMmsvWngxRGJnUlh5SDdPSWczR2dzaXBEMHpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQlBvSTh1QUVzVwpBU29TeFQ4QXRjNU5ZbXZLOU9CUytQMjdDcTZHb3VNU3U0cUkwbjlJSE5nUVJKdkllZTZuOU1UTHhSK3Jma0dKClJIeFRiK240eTlDS25pL1ozWDhQdkFLRlp2Mk1kVGQ5RnZibi9aTWVkWTkyMlRTSEQzNzFBTkZ1ZXowUCtQUVcKckFjQUZyMHByOXN1L2hncHVpdEhnZitNYmRTYjlRazB1bGkyUmp2Zkg0VUs0VitFN3F2U1V1cW1uTGRURFkyUQprNy8yckEzM2JmRkdoSmNDMWRiOHh5QmVXeWVORzR6d3lZWjBjdjM3UlFsU0pjdlFHd3Z4NDFJbmxJeHIyellFClFVV2dGMEt3Z2RPRnpqMXlpL0NiaThrbDAwNXVwVGtwMUMvQldOT1R2cnlCekorR3J1VkpEVDAycjQyVGVvM0YKaXVJVnROOS83ZTc3Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @carla-gb, Action: `pull_request`*